{
  "title": "About Me",
  "content": "At the end of 2024, I achieved my lifelong ambition of opening a beauty therapy business, in the most idyllic location… I really have to pinch myself!&nbsp;\n\nI knew I was destined to become a beauty therapist from an early age... &nbsp;I was obsessed with my eldest sisters make up, and I absolutely adored her beautiful, manicured nails that she would get done at the nail salon. I was so jealous that I was too young to get mine done! I would spend my pocket money on stick-on nails, and even though they would only last an hour… I felt so glamorous and grown up!\n\nI remember being so enthralled by my sister’s skin care products; the beautiful smells, the different textures and discovering what each product could do to improve the skin. As I got older, I found myself buying all the skin care products I could find, even when I did not need them! An addiction was born! I became aware of how our skin makes us feel, when it is healthy and glowing, we glow from the inside!&nbsp;\n\nI became \"the friend\" who did the girls make-up on nights out, plucked and shaped their brows and took care of any essential waxing before holidays or first dates! I love getting my tweezers out to get those really stubborn and hard to get hairs! It’s so therapeutic!\n\nWhen I studied Anatomy & Physiology as part of my level 2 & 3 beauty therapy and spa, I was fascinated by the body and how it works. I understood how being a beauty therapist is more than helping someone to relax or feel good. I wanted to understand the body on a deeper level so that I could perform the safest and most beneficial treatments for my clients. I really enjoy massage, and my fascination with how the body functions, and understanding the muscles and lymphatic system really plays an important part when I am performing a massage on a client.\n\nI always knew from an early age that I wanted to help people in some way; making someone’s life a little easier, a little calmer and a little less hectic. My friends and family would describe me as warm and understanding, non-judgmental and with lots of love to give. This, combined with my desire to nurture people, is the sole reason I embarked on my studies in beauty therapy. Of course, I love all things beauty related, from the products to the treatments and the excitement in the industry… But for me, it was always about people, about giving someone the opportunity of putting themselves first for a moment, a moment of self-love, and self-appreciation.\n\nI obtained distinction in my exams and assessments throughout my level 2 & 3 beauty therapy and spa studies, and this is something of which I am extremely proud. I believe wholeheartedly that this is what I am supposed to do. I really do care about making people feel better, think clearer, feel gorgeous and calm and relaxed. If I am able to facilitate a safe space for someone to come and let go for a little while, to really be present in a moment of self-love, and to be able, for a short while, to forget the stresses of life, I have achieved my goal. One very happy beauty therapist 😊&nbsp;\n\nIt's crazy… years ago, when I was around 10 years old, my childhood best friend and I (still besties today!) would ride our bikes to the beautiful village of Filleigh in North Devon. We would park our bikes up against the metal railed fencing and take out our sketch books and pencils and sit for hours and sketch the beautiful Castle Hill Estate and its gardens. We used to create fanciful stories and tales about what it would be like to live in such a wonderful building. Fast forward to today, and I sit here writing this, looking over the gardens from my beauty room, that I once sketched. Little did I realise then, that I would open my own beauty business in that same magical building, performing equally magical treatments 26 years later. It was meant to be.&nbsp;\n\n‘Beauty Awakening, by Chantelle’ is my most cherished and proudest accomplishment, (aside from my cheeky teenager, who keeps me on my toes!) and as I write this, I can’t help but feel super proud and grateful that this opportunity that I have dreamt of, for so many years, has finally come to fruition.\n\nHonestly, I am so excited to embark on this incredible journey, to meet all of you lovely clients, to get to know each and every one of you and welcome you to my cosy little salon at the beautiful Castle Hill Gardens.\n\nLove Chantelle x&nbsp;\n"
}
